<template>
  <div>

    <v-dialog
      v-model="showTermsOfUse"
      fullscreen
    >
      <v-card>
        <h2 class="head d-flex justify-center" style="padding: 12px; background-color: white;"> TermsOfUse </h2>
          <v-btn
            icon
            class="close-dialog"
            @click="hideDialog"
          >
            <v-icon>mdi-close</v-icon>
        </v-btn>
        <h5 v-for="(term,idx) in terms" :key="idx">{{ term }}</h5>

      </v-card>

    </v-dialog>
  </div>
</template>

<script>
export default {
  props: ['showTermsOfUse'],
  data: () => ({
    terms: ['제 1조 목적', '이 약관은 Team.ㅇ1ㄱ4(이하 “회사”라 합니다.)가 제공하는 학습 서비스(이하 “서비스” 라 합니다.)를 이용함에 있어 “회사”와 이용 고객 (이하 “고객”이라 합니다.)의 권리와 의무를 비롯해 책임과 기타 제반 사항을 규정하기 위한 목적입니다.',
    '제 2조 서비스 내용', '본 서비스는 한국의 문화 컨텐츠(영화, 드라마, 음악 등)를 기반으로 무료 학습을 제공하고 있습니다. 해당 서비스는 비영리적인 목적을 기반으로 제작되었습니다. 또한 서비스 내에는 어떠한 금리적 이득을 취할 수 있는 방법이 없습니다. 이에 해당 서비스를 이용한 후 발생하는 어떠한 금전적 손해에 대해서는 회사는 책임을 지지 않습니다.',
    '제 3조 회원가입 및 정보변경', '1. 본 서비스는 회원가입 절차 완료 후 이용이 가능하며, 회원가입 시 기재한 사항이 변경되었을 경우에는 고객이 앱 내에서 직접 수정해야 합니다.', '2. 고객이 제 1항의 회원정보 변경사항을 회사에 알리지 않아 발생한 불이익에 대해 회사는 책임지지 않습니다.',
    '제 4조 서비스 내용', '1. 본 서비스의 내용은 크게 학습, 테스트, 업적으로 이루어져 있습니다.','2. 학습 창에서는 카테고리(영화, 드라마, 음악)에 따른 학습을 진행할 수 있습니다.','3. 테스트 창에서는 지금까지 학습한 내용을 기반으로 시험을 치룰 수 있습니다.','4. 업적 창에서는 고객의 활동을 기반으로 얻은 뱃지(앱 내에서만)를 확인할 수 있습니다.',
    '제 5조 지적 재산권', '본 서비스는 한국의 문화 컨텐츠(영화, 드라마, 음악 등)를 기반으로 만들어졌습니다. 이에 컨텐츠의 권리에 대한 내용을 앱 내에서 언제든 확인할 수 있으며, 차후 문제가 발생할 경우, 언제든 서비스를 중단할 수 있습니다. 또한, 고객이 서비스를 어떠한 형태로든 상업적으로 이용할 경우, 모든 법적 책임은 고객에게 있습니다.',
    '제 6조 컨텐츠 이용제한', '1. 모든 컨텐츠는 하위 라이선스를 발행하거나 재배포, 재분배, 재판매(배급, 양도, 대여, 임대, 임차)를 할 수 없습니다.', '2. 모든 컨텐츠는 아래와 같은 용도로 사용할 수 없습니다.① 음란물 및 성인 광고, 유흥업소, 고리대금업, 기타 풍속업 등 사회 미풍양속을 저해하는 용도① 기타 불법적인 사용', '3. 모든 콘텐츠는 비독점적 사용을 전제로 제공되는 것입니다.', '4. 모든 컨텐츠는 비 영리적이며, 단순 학습을 위해 제공되는 것입니다. 이에 이를 재가공(2차 창작 등)하는 것을 금합니다. 이로 인한 모든 책임은 고객에게 있습니다.', '5. 저작물을 납품(제2차 사용자에게 제공)시 납품된 저작물의 원본 소스는 동시에 납품할 수 없습니다. 만일 원본 저작물을 납품하여 클라이언트가 원본 콘텐츠를 이용하여 2차 제작물을 제작할 경우, 그로 인한 모든 책임은 납품한 회원에게 있습니다.',
    '제 7조 서비스 이용의 제한.해지', '1. 해당 서비스는 언제든지 중단 및 수정될 수 있습니다.',
    '제 8조 회사의 의무','1. 회사는 이 약관에서 정한 바에 따라 계속적, 안정적으로 서비스를 제공할 수 있도록 최선의 노력을 다해야 합니다.','2. 회사는 서비스와 관련한 고객의 불만사항이 접수되는 경우 이를 즉시 처리해야 하며, 즉시 처리가 곤란한 경우 그 사유와 처리 일정을 이메일을 통해 고객에게 통지해야 합니다.','3. 회사에 제공되는 모든 고객정보는 암호화 되며, 어떠한 이유로든 재사용되지 않습니다.','4. 서비스가 중단되는 경우, 이를 사전에 공지해야 하며, 고객의 정보는 전량 폐기됩니다.',
    '제 9조 고객의 의무', '1. 고객은 관계법령, 이 약관의 규정, 이용안내 및 주의사항 등 회사가 통지하는 사항을 준수해야 하며, 기타 회사의 업무에 방해되는 행위를 해서는 안됩니다.', '2. 고객은 서비스 이용과 관련해 다음 각 호의 행위를 해서는 안됩니다.','2-1. 다른 회원의 아이디(ID)를 부정 사용하는 행위', '2-2. 범죄행위를 목적으로 하거나 기타 범죄행위와 관련된 행위','2-3. 타인의 지적재산권 등의 권리를 침해하는 행위','2-4. 타인에 대한 개인정보를 수집 또는 저장하는 행위','2-5. 해킹행위 또는 컴퓨터바이러스의 유포행위','2-6. 타인의 의사에 반해 광고성 정보 등 일정한 내용을 지속적으로 전송하는 행위','2-7. 서비스의 안정적인 운영에 지장을 주거나 줄 우려가 있는 일체의 행위','2-8. 관계법령에 위배되는 행위','2-9. 기타 회사가 서비스 운영상 부적절하다고 판단하는 행위',
    '제 10조 고객에 대한 통지', '회사가 고객에 대한 통지를 하는 경우 이 이용약관에 별도 규정이 없는 한 온라인 서비스, 이메일, SMS 등으로 할 수 있습니다.',
    '제 11조 손해배상 책임', '회사와 고객 중 어느 일방이 본 서비스 이용 약관에 규정된 의무 이행을 해태 하거나 또는 지연 시킬 때에는 그 행위를 야기한 당사자는 그러한 불이행에 대해 전적으로 책임을 지며, 그에 따른 일체의 손해를 배상함과 동시에 상대방이 요구하는 모든 적절한 조치를 취해야 합니다.',
    '제 12조 계약의 해석','본 서비스이용 약관의 해석상 이의가 있거나 약관에 명시되지 않은 사항에 대해서는 회사와 고객의 상호 합의에 따릅니다.',
    '제 13조 개인정보보호 의무','회사는 “정보통신망법”등 관계법령이 정하는 바에 따라 고객의 개인정보를 보호하기 위하여 노력합니다. 개인정보의 보호 및 사용에 대해서는 관련법 및 회사의 개인정보 취급방침이 적용됩니다.',
    '제 14조 손해배상','회사가 제공하는 서비스로 인해 고객에게 손해가 발생하는 경우 회사는 그 손해가 회사의 고의 또는 중과실에 의한 경우에 한해 통상손해의 범위에서 손해배상책임을 부담합니다.',
    '제 15조 면책조항','1. 회사는 천재지변, 전쟁 및 기타 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 대한 책임을 지지 않습니다.','2. 회사는 기간통신 사업자가 전기통신 서비스를 중지하거나 정상적으로 제공하지 아니하여 손해가 발생한 경우에는 책임을 지지 않습니다.','3. 회사는 서비스용 설비의 보수, 교체, 정기점검, 공사 등 부득이한 사유로 발생한 손해에 대한 책임을 지지 않습니다.','4. 회사는 고객의 귀책사유로 인한 서비스 이용의 장애 또는 손해에 대해 책임을 지지 않습니다.','5. 회사는 고객의 컴퓨터 오류에 의해 손해가 발생한 경우, 또는 고객이 신상정보나 이메일(전자우편) 주소를 부실하게 기재하여 손해가 발생한 경우 책임을 지지 않습니다.','6. 회사는 고객이 서비스를 이용하여 기대하는 학습 결과에 대해 책임을 지지 않습니다.','7. 회사는 고객이 서비스를 이용하면서 얻은 자료로 인한 손해에 대해 책임을 지지 않습니다. 또한 회사는 고객이 서비스를 이용하며 타인으로 인해 입게 되는 정신적 피해에 대하여 보상할 책임을 지지 않습니다.','8. 회사는 고객이 서비스에 게재한 각종 정보, 자료, 사실의 신뢰도, 정확성 등 내용에 대해 책임을 지지 않습니다.','9. 회사는 고객 상호간 및 고객과 제 3자 상호 간에 서비스를 매개로 발생한 분쟁에 대해 개입할 의무가 없으며, 이로 인한 손해를 배상할 책임도 없습니다.',
    '제 16조 재판권 및 준거법','본 약관에 명시되지 않은 사항은 전기통신사업법 등 관계법령과 상관습에 따릅니다. 서비스 이용으로 발생한 고객과의 분쟁에 대해 소송이 제기되는 경우 회사의 본사 소재지를 관할하는 법원을 관할 법원으로 합니다.',
    '부 칙', '(시행일)본 약관은 2021년 04월 01일부터 적용됩니다.'

    ]
  }),
  methods: {
    hideDialog () {
      this.$emit('hideTutorial')
    }
  }
  
}
</script>

<style>

h5 {
  margin-left: 2%;
  margin-top: 2%;
  margin-right: 2%;
}


</style>