<template>
  <v-container>
    <h1>학습내역페이지</h1>
    <h1>학습내역페이지</h1>
    <h1>학습내역페이지</h1>
    <h1>학습내역페이지</h1>
    <h1>학습내역페이지</h1>
    <h1>학습내역페이지</h1>
    <h1>학습내역페이지</h1>
    <h1>학습내역페이지</h1>
    <h1>학습내역페이지</h1>
    <h1>학습내역페이지</h1>
    <h1>학습내역페이지</h1>
    <h1>학습내역페이지</h1>
    <h1>학습내역페이지</h1>
    <h1>학습내역페이지</h1>
    <h1>학습내역페이지</h1>
    <h1>학습내역페이지</h1>
    <h1>학습내역페이지</h1>
    <h1>학습내역페이지</h1>
    <h1>학습내역페이지</h1>
    <h1>학습내역페이지</h1>
    <h1>학습내역페이지</h1>
    <h1>학습내역페이지</h1>

  </v-container>
</template>

<script>

export default {
  components: {

  }
}
</script>

<style>

</style>